# TODO; Python3 运算符

"""
什么是运算符？
本章节主要说明Python的运算符。举个简单的例子 4 +5 = 9 。 例子中，4 和 5 被称为操作数，"+" 称为运算符。

Python语言支持以下类型的运算符:

算术运算符
比较（关系）运算符
赋值运算符
逻辑运算符
位运算符
成员运算符
身份运算符
运算符优先级
接下来让我们一个个来学习Python的运算符。

"""

# Python算术运算符
"""
以下假设变量a为10，变量b为21：

运算符	描述	                                             实例
+	    加  两个对象相加	                                 a + b 输出结果 31
-	    减  得到负数或是一个数减去另一个数	                 a - b 输出结果 -11
*	    乘  两个数相乘或是返回一个被重复若干次的字符串   	     a * b 输出结果 210
/	    除  x 除以 y	                                     b / a 输出结果 2.1
%	    取模  返回除法的余数	                             b % a 输出结果 1
**	    幂  返回x的y次幂	                                 a**b 为10的21次方
//	    取整除  返回商的整数部分	                         9//2 输出结果 4 , 9.0//2.0 输出结果 4.0


"""


